app/Controllers/Admin.php

SELECT *
FROM `api_request_logs`
WHERE `timestamp` > '2025-06-29 16:46:50'
ORDER BY `timestamp` DESC
 LIMIT 100
---
    public function getLiveRequestData()
    {
        if (!$this->isAdmin()) {
            return $this->response->setJSON(['success' => false, 'message' => 'Access denied']);
        }

        try {
            $db = \Config\Database::connect();

            // Get recent API requests (last 24 hours)
            $query = $db->table('api_request_logs')
                       ->select('*')
                       ->where('timestamp >', date('Y-m-d H:i:s', strtotime('-24 hours')))
                       ->orderBy('timestamp', 'DESC')
                       ->limit(100);

            $requests = $query->get()->getResultArray();