app/Controllers/ApiController.php

    private function logApiRequest($userType, $userEmail, $endpoint, $method, $status, $responseTime, $rateLimitHit = false, $userId = null): void
    {
        try {
            $db = \Config\Database::connect();

            $logData = [
                'user_id' => $userId,
                'user_email' => $userEmail !== 'unknown' ? $userEmail : null,
                'user_type' => $userType !== 'unknown' ? $userType : null,
                'endpoint' => $endpoint,
                'method' => $method,
                'status' => $status,
                'response_time' => is_numeric($responseTime) ? $responseTime . 'ms' : $responseTime,
                'ip' => $this->request->getIPAddress(),
                'rate_limit_hit' => $rateLimitHit ? 1 : 0,
                'timestamp' => date('Y-m-d H:i:s')
            ];

            $db->table('api_request_logs')->insert($logData);
---
INSERT INTO `api_request_logs` (`user_id`, `user_email`, `user_type`, `endpoint`, `method`, `status`, `response_time`, `ip`, `rate_limit_hit`, `timestamp`) VALUES (NULL, 'johnpaulmorada1234@gmail.com', 'admin', '/api/v1/tjD9cb', 'GET', 200, '113ms', '::1', 1, '2025-06-30 14:04:19')