app/Models/ApiKeyModel.php

SELECT *
FROM `api_keys`
WHERE `user_id` = 'tjD9cb'
AND `is_active` = 1
ORDER BY `created_at` DESC
---
    public function getUserApiKeys(string $userId): array
    {
        return $this->where('user_id', $userId)
                    ->where('is_active', 1)
                    ->orderBy('created_at', 'DESC')
                    ->findAll();

SELECT *
FROM `api_keys`
WHERE `api_key` = 'rio_11eabc3c793401b780fa0e14652a2db180525930d438995d'
AND `is_active` = 1
 LIMIT 1
UPDATE `api_keys` SET `last_used_at` = '2025-06-30 14:04:19'
WHERE `api_keys`.`id` IN ('6')
---
    public function verifyApiKey(string $apiKey): ?array
    {
        $key = $this->where('api_key', $apiKey)
                    ->where('is_active', 1)
                    ->first();

        if ($key) {
            // Update last used timestamp
            $this->update($key['id'], ['last_used_at' => date('Y-m-d H:i:s')]);

SELECT COUNT(*) AS `numrows`
FROM `api_keys`
WHERE `user_id` = 'tjD9cb'
SELECT COUNT(*) AS `numrows`
FROM `api_keys`
WHERE `user_id` = 'tjD9cb'
AND `is_active` = 1
SELECT COUNT(*) AS `numrows`
FROM `api_keys`
WHERE `user_id` = 'tjD9cb'
AND `last_used_at` >= '2025-06-23 16:28:21'
---
    public function getApiKeyStats(string $userId): array
    {
        $total = $this->where('user_id', $userId)->countAllResults();
        $active = $this->where('user_id', $userId)->where('is_active', 1)->countAllResults();
        $recentlyUsed = $this->where('user_id', $userId)
                             ->where('last_used_at >=', date('Y-m-d H:i:s', strtotime('-7 days')))
                             ->countAllResults();

SELECT *
FROM `api_keys`
WHERE `api_key` = 'rio_11eabc3c793401b780fa0e14652a2db180525930d438995d'
AND `is_active` = 1
 LIMIT 1
---
    public function validateDomain(string $apiKey, string $domain): bool
    {
        $key = $this->where('api_key', $apiKey)
                    ->where('is_active', 1)
                    ->first();